import News from '../models/News.js'

class NewsService {
  // async getAll() {
  //   const posts = await News.find()
  //   return posts
  // }

  // Функции для определения времени обновления должны быть в отдельной директории

  // Проверка на нужные категории 

  // Проверка на нужные источники



}

// должна быть проверка новостей после окончания обновления списка. 
// Сжатие новостей происходит через текстовую модель сразу после отработки проверки. 
// Лишь после сжатия запись в бд.

export default new NewsService()
